### Extração de arquivo da web

In [1]:
# Importando o pacote urlopen to pacote urllib.request
from urllib.request import urlopen
response = urlopen('http://vimeo.com/api/v2/video/31161781.json').read().decode('utf8')

## "Explodir" valores separados por vírgula numa mesma célula para várias linhas

In [ ]:
# Separar valores separados por vírgula na mesma coluna, duplicando a linha

# Example data
data = {
    'title': ['Movie A', 'Movie B', 'Movie C'],
    'production_companies': ['Company 1, Company 2', 'Company 3', 'Company 4, Company 5, Company 6']
}
df_teste = pd.DataFrame(data)

# Step 1: Split the `production_companies` column into lists
df_teste['production_companies'] = df_teste['production_companies'].str.split(',')

# Step 2: Use `explode` to create one row per production company
df_exploded = df_teste.explode('production_companies')

# Step 3: Trim any leading/trailing whitespace
df_exploded['production_companies'] = df_exploded['production_companies'].str.strip()

# Display the result
print(df_exploded)

## Preencher valores vazios (interpolação moda)

In [21]:
import pandas as pd
# Importando o numpy só pra acrescentar um valor vazio pro exemplo
import numpy as np

## Criando dataframe pro exemplo

df = {'title': ['Movie A','Movie B','Movie C','Movie D','Movie E'],
      'box_office':[20000,52000,52000,np.nan,30000]}
df = pd.DataFrame(df)
df.head()

# Achando a moda
# A método .value_counts() retorna uma tabela com a quantidade de cada valor na coluna, do maior pro menor.
# Quando pegamos o index 0, pegamos o valor mais comum, ou seja, a moda.

moda = df['box_office'].value_counts().index[0]

# Preenchendo valores vazios com a moda
# inplace=True para substituir no df, inplace=False ou não incluir para criar cópia

df.fillna({'box_office':moda},inplace=True)

# Verificar se deu tudo certo:

df.head()

     title  box_office
0  Movie A     20000.0
1  Movie B     52000.0
2  Movie C     52000.0
3  Movie D     52000.0
4  Movie E     30000.0

### Filtrar um dataframe de acordo com valor na tabela

In [19]:
## Filtrar se valor for exatamente igual:

df[df['title'] == 'Movie A']

     title  box_office
0  Movie A     20000.0

In [22]:
## Filtrar se mais de um valor está contido na coluna

df[df['box_office'].isin([20000,30000])]

     title  box_office
0  Movie A     20000.0
4  Movie E     30000.0

### Mostrar apenas N primeiras linhas do dataframe

In [23]:
# Com .head()
# Padrão: 5 primeiras linhas

df.head(2)

     title  box_office
0  Movie A     20000.0
1  Movie B     52000.0

In [24]:
# Com [] (notação de slicing)

df[:2]

     title  box_office
0  Movie A     20000.0
1  Movie B     52000.0

In [28]:
# Com slicing dá para fazer com intervalos específicos tb

df[2:5]

     title  box_office
2  Movie C     52000.0
3  Movie D     52000.0
4  Movie E     30000.0